0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            zeroGradient;
        value			uniform 0;
    }

    outlet_side_1
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_side_2
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_side_3
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_side_4
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_side_5
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_side_6
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_side_7
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_side_8
    {
        type            fixedValue;
        value           uniform 0;
    }
	
    workpiece
    {
        type            zeroGradient;
        value			uniform 0;
    }
	
    wall
    {
       type             zeroGradient;
       value			uniform 0;
    }
	
	outlet
    {
        type            zeroGradient;
        value			uniform 0;
    }
	
    tool
    {
        type            zeroGradient;
        value			uniform 0;
    }
	
    front
    {
        type            zeroGradient;
        value           uniform 0;
    }
	
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
